Revit 2027 API
BuiltInFailures.StairRampFailures.RailPlacedOutsideOfHost Property
 Railings are placed completely outside the host. It may change the adjustment of the railing to the host and its vertical position.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RailPlacedOutsideOfHost { get; }
Public Shared ReadOnly Property RailPlacedOutsideOfHost As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RailPlacedOutsideOfHost {
	FailureDefinitionId^ get ();
}
static member RailPlacedOutsideOfHost : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace